<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Hot File
    |--------------------------------------------------------------------------
    | เก็บพาธไฟล์ hot สำหรับโหมด dev. ถ้าใช้หลาย bundle
    | แยกไฟล์ hot คนละชื่อกันได้
    */
    'hot_file' => storage_path('framework/vite.admin.hot'),

    /*
    |--------------------------------------------------------------------------
    | Build Path
    |--------------------------------------------------------------------------
    | โฟลเดอร์ที่เก็บไฟล์ build แล้ว (ฝั่ง production)
    */
    'build_path' => public_path('build/admin'),

    /*
    |--------------------------------------------------------------------------
    | Dev Server
    |--------------------------------------------------------------------------
    | URL ที่ใช้ตอน dev (hmr)
    */
    'dev_server' => [
        'url' => env('VITE_DEV_SERVER_URL', 'http://admin.localhost:5173'),
        'ping_timeout' => 3,
    ],

    /*
    |--------------------------------------------------------------------------
    | Manifest Filename
    |--------------------------------------------------------------------------
    */
    'manifest' => [
        'filename' => 'manifest.json',
    ],

];
